mmccoo/stm32_mmccoo/uart_spi_iic/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_SPI1_Init();
  MX_I2C1_Init();

  // this was a short attempt to reset i2c busy issue. it didn't work.
  // I probably just didn't take it far enough. "for now", will just
  // make sure I2C clock is enabled before the rest of i2c. The boot issue
  // is what I'm trying to solve today and I just want to go on.
  //SET_BIT(hi2c1.Instance->CR1, I2C_CR1_SWRST);
  //HAL_I2C_Init(&hi2c1);
  
  /* USER CODE BEGIN 2 */
  UNUSEDVAR uint8_t themessage[] = "E.T. is phoning home. Anyone there? Be sure to check spi\n";
  UNUSEDVAR uint8_t theothermessage[] = "Hey. I hate to interrupt, but...\n";
  UNUSEDVAR uint8_t spimessage[] = "This is a secret side message over spi\n";
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  UNUSEDVAR uint8_t uart_poll = 1;
  UNUSEDVAR uint8_t spi_poll = 1;
  //uint8_t text_size = 0;

  u8g2_Setup_ssd1306_i2c_128x64_noname_f(&u8g2,
                                         U8G2_R0,
                                         u8x8_byte_my_hw_i2c,
                                         u8x8_gpio_and_delay_mine);
  
  u8g2_InitDisplay(&u8g2); // send init sequence to the display, display is in sleep mode after this,
  { uint8_t umsg[] = "done with init\n"; sendUARTmsgPoll(umsg, sizeof(umsg)); }
  u8g2_SetPowerSave(&u8g2, 0); // wake up display
  { uint8_t umsg[] = "first page\n"; sendUARTmsgPoll(umsg, sizeof(umsg)); }

#if 0
  u8g2_FirstPage(&u8g2);
  do {
    { uint8_t umsg[] = "set font\n"; sendUARTmsgPoll(umsg, sizeof(umsg)); }
    u8g2_SetFont(&u8g2, u8g2_font_ncenB14_tr);
    { uint8_t umsg[] = "draw hello\n"; sendUARTmsgPoll(umsg, sizeof(umsg)); }
    u8g2_DrawStr(&u8g2, 0,24,"Hi World!");
    { uint8_t umsg[] = "done\n"; sendUARTmsgPoll(umsg, sizeof(umsg)); }
  } while ( u8g2_NextPage(&u8g2) );
#endif

#if 1
  //u8g2_FirstPage(&u8g2);
  //do {
  //u8g2_DrawBox(&u8g2, 10,20, 20, 30);
    u8g2_SetFont(&u8g2, u8g2_font_ncenB14_tr);
    //u8g2_DrawStr(&u8g2, 0,15,"This World!");
    //u8g2_DrawStr(&u8g2, 0,30,"Other World!");
    //u8g2_DrawXBM(&u8g2, 0, 20, LOGO16_GLCD_WIDTH, LOGO16_GLCD_HEIGHT, logo16_glcd_bmp);
    u8g2_SetDrawColor(&u8g2, 0);
    u8g2_DrawXBM(&u8g2, 0, 0, lydia_width, lydia_height, lydia_bits);
    u8g2_DrawXBM(&u8g2, 64, 0, xlogo64_width, xlogo64_height, xlogo64_bits);
#endif

#if 0
    u8g2_SetFontMode(&u8g2, 1);	// Transparent
    u8g2_SetFontDirection(&u8g2, 0);
    u8g2_SetFont(&u8g2, u8g2_font_inb24_mf);
    u8g2_DrawStr(&u8g2, 0, 30, "U");
    
    u8g2_SetFontDirection(&u8g2, 1);
    u8g2_SetFont(&u8g2, u8g2_font_inb30_mn);
    u8g2_DrawStr(&u8g2, 21,8,"8");
        
    u8g2_SetFontDirection(&u8g2, 0);
    u8g2_SetFont(&u8g2, u8g2_font_inb24_mf);
    u8g2_DrawStr(&u8g2, 51,30,"g");
    u8g2_DrawStr(&u8g2, 67,30,"\xb2");
    
    u8g2_DrawHLine(&u8g2, 2, 35, 47);
    u8g2_DrawHLine(&u8g2, 3, 36, 47);
    u8g2_DrawVLine(&u8g2, 45, 32, 12);
    u8g2_DrawVLine(&u8g2, 46, 33, 12);
  
    u8g2_SetFont(&u8g2, u8g2_font_4x6_tr);
    u8g2_DrawStr(&u8g2, 1,54,"github.com/olikraus/u8g2");
#endif
    
    u8g2_SendBuffer(&u8g2);
    //} while ( u8g2_NextPage(&u8g2) );

    UNUSEDVAR uint32_t myfreq = HAL_RCC_GetSysClockFreq();
    UNUSEDVAR uint32_t mysize = * (uint32_t*) FLASHSIZE_BASE;
    UNUSEDVAR uint32_t myid   = * (uint32_t*) UID_BASE;
  
  //InitOled();
  //OLED_Fill(0);
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
    // p HAL_I2C_GetState (&hi2c1)
    // p __HAL_I2C_GET_FLAG(&hi2c1, I2C_FLAG_BUSY)


    HAL_I2C_StateTypeDef iicstate =  HAL_I2C_GetState (&hi2c1);
    HAL_UART_StateTypeDef uartstate = HAL_UART_GetState(&huart1);
    if ((iicstate  == HAL_I2C_STATE_READY) &&
        (uartstate == HAL_UART_STATE_READY)) {
#if 0
      // this is basically a I2C address scanner.
      // I used it to verify that oled is at 120 and 121.
      // the actual addresses are half that and the second is simply the other
      // of read/write.
      
      uint8_t ii2messagealive[] = "I2C channel xxx is alive\n";
      uint8_t ii2messagedead[]  = "I2C channel xxx is dead\n";

      for(uint8_t i=0; i<128; i++) {
        uint8_t pData[] = "hello";
        HAL_StatusTypeDef iicstatus UNUSEDVAR;
        iicstatus = HAL_I2C_Master_Transmit(&hi2c1, i, pData, sizeof(pData), 10);
        if (iicstatus == HAL_OK) {
          byte_at_string(ii2messagealive+12, i);
          HAL_UART_Transmit(&huart1, ii2messagealive, sizeof(ii2messagealive), HAL_MAX_DELAY);
        } else {
          byte_at_string(ii2messagedead+12, i);
          HAL_UART_Transmit(&huart1, ii2messagedead, sizeof(ii2messagedead), HAL_MAX_DELAY);
        }
      }
#endif
      
      //OLED_ShowStr(0,3, (unsigned char*) "HelTec Automation", (text_size++ % 2));
    }
    
#if 0
    if (uartstate == HAL_UART_STATE_READY) {
      HAL_StatusTypeDef tstate UNUSEDVAR;
      if (uart_poll) {
        //tstate = HAL_UART_Transmit(&huart1, themessage, sizeof(themessage), HAL_MAX_DELAY);
        sendUARTmsgPoll(themessage, sizeof(themessage));
      } else {
        tstate = HAL_UART_Transmit_IT(&huart1, theothermessage, sizeof(theothermessage));     
      }
      uart_poll = !uart_poll;
      uartstate = HAL_UART_GetState(&huart1);
    }
#endif

#if 0
    HAL_SPI_StateTypeDef spistate =  HAL_SPI_GetState (&hspi1);
    if (spistate == HAL_SPI_STATE_READY) {
      HAL_StatusTypeDef hstatus UNUSEDVAR;
      if (spi_poll) {
        hstatus = HAL_SPI_Transmit (&hspi1, spimessage, sizeof(spimessage), HAL_MAX_DELAY);
      }
      spi_poll = !spi_poll;
      spistate =  HAL_SPI_GetState (&hspi1);
    }
#endif
    
#if 0
    GPIOC->ODR |= GPIO_PIN_13;
    delayLoop();
    delayLoop();
    GPIOC->ODR &= ~(GPIO_PIN_13);
    delayLoop();
#endif
  }
  /* USER CODE END 3 */

}

